"""
Settings for Telegram bot @ColdHotGameBot using @BotFather

ColdHotGame bot v3.0 (c) 2020-2023 Maksym Trineiev
mtrineyev@gmail.com
"""

BOT_NAME = """
❄️☀️ColdHotGame
"""

BOT_ABOUT = """
Гра "Вгадай Число" 🤔 методом "Холодно-Спекотно" ❄️☀️
автор @mtrineyev
"""

BOT_DESCRIPTION = """
🤖 загадає ціле число від 1 до 1000, яке треба вгадати якнайшвидше,
використовуючи підказки 💪 Це може бути не так і просто,
як може здатися спочатку 🤨 Наважишся ⁉️ Тоді тисни "Старт" і почнемо гру 🏁
"""

BOT_COMMANDS = """
start - Почати гру
help - Допомога
hardcore - Важкий режим
leaders - Лідери
stats - Моя статистика
stop - Припинити поточну гру
"""


if __name__ == "__main__":
    print(__doc__)
