"""
Contains messages for ColdHotGame bot

ColdHotGame bot v3.0 (c) 2020-2023 Maksym Trineiev
mtrineyev@gmail.com
"""

REPLIES = (
    "😽", "😮", "❤", "🤯", "💩", "😂", "🥱", "💤", "😉", "🙃",
    "Як ся маєш? 😎", "Можливо все ж таки зіграємо? 😉",
    "Зараз усну\\.\\.\\. 😪", "I beg your pardon, sir 😐"
)
ERRORS = (
    "Таких чисел не буває 🤨", "Прошу? 🤔",
    "А кількість спроб більшає 🤭", "⏱ Тік\\-так, тік\\-так\\.\\.\\.",
    "Раз, два, три — починаю мерзнути ☃"
)
HINTS = (
    "@NameTheNumberBot 🚀", "👻", "🌚", "Арктика\\!\\!\\! 🥶",
    "Вічна мерзлота\\!\\!\\. 😱", "Морозилка\\!\\.\\. 😨",
    "Холодно\\.\\.\\. 😕", "Прохолодно 😐", "Тепло 🙂",
    "Спекотно\\.\\.\\. ☺", "Гаряче\\!\\.\\. 🤒", "Пекельно\\!\\!\\. 🥵",
    "Підгоряє\\!\\!\\! 😈", "Зовсім поруч 🔥🔥🔥"
)

HELLO = (
    "👋 Привіт, *{0}\\!* Радий познайомитися 🥰 "
    "Якщо потрібна допомога, команда /help завжди до твоїх послуг"
)
HELP_OUT_GAME = (
    "🏁 Бот загадає ціле число від 1 до {0}, яке треба вгадати якнайшвидше, "
    "використовуючи підказки\\.\n\n"
    "📌 *Підказка* натякає, як _далеко_ твоя здогадка знаходиться "
    "від задуманого числа\\. Чим гарячіше 🔥, тим ти ближче і навпаки — "
    "чим холодніше 🥶, тим твоє число далі від відповіді\\.\n\n"
    "||❗ Оцінюється лише _відстань_ до числа, а не більше воно, чи менше\\. "
    "Наприклад, якщо 🤖 задумав число 200, "
    "то для 195 та 205 підказка буде та ж сама — Підгоряє\\!\\!\\! 😈||\n\n"    
    "*Команди:*\n"
    "/start — 😌 звичайна гра\n"
    "/hardcore — 🤪 складна гра\n"
    "/stop — ✋ зупинити поточну гру\n"
    "/leaders — 🎖 таблиця лідерів TOP\\-3\n"
    "/stats — ✍ статистика твоїх ігор\n"
    "/help — 🤝 допомога\n\n"
    "*Самореклама:*\n"
    "@NameTheNumberBot — назви чисел"
)
HELP_IN_GAME = (
    "*Підказки:*\n\n"
    "{0}\n\n"
    "*Зупинити* поточну гру — /stop"
)

START_GAME = (
    "🏁 *Гра починається\\!*\n"
    "Загадане ціле число від 1 до {0} 🤐\n"
    "Відгадай його якнайшвидше 🚀\n\n"
    "Допомога по підказкам — /help"
)
START_GAME_OTHER_CHAT = (
    "Агов, {0}\\! Гра запущена у твоєму особистому екземплярі @ColdHotGameBot, "
    "хутчіше переходь туди та відгадуй число\\. Бажаю успіху\\!"
)
GAME_ALREADY_STARTED = (
    "Гра вже активована\\! Час: {0} ⏱\n"
    "Мерщій відгадуй число або зупиняй гру командою /stop"
)
START_COMMANDS = "/start чи /hardcore 😉"
END_GAME = (
    "*Бінго\\!* 🥳🏅\n\n"
    "Число угадане за {0} 🏹\n"
    "Час: {1} ⏱\n\n"
    "Сподіваюся, тобі сподобалося 🙃\n"
    f"Запустити нову гру {START_COMMANDS}"
)
ABORT_GAME = (
    "❌ *Гра перервана*\n\n"
    f"Спробуєш ще? {START_COMMANDS}"
)
NO_GAME_STARTED = "Неможливо зупинити те, що не рухається © МТ 😏"

EXCLAMATION = "\n\n*Wow\\!* 🎊🎁🎉"
RECORD_HEADER = "\n🏆 Особистий рекорд по"
RECORD_TIME = "часу"
RECORD_STEPS = "крокам"
GAME_TYPE = ("у звичайній грі", "у складній грі")
RECORD_FOOTER = (
    "\n\n🎖 Подивитися таблицю лідерів /leaders\n"
    "💪 Дізнатися статистику своїх ігор /stats"
)

MEDALS = ("🥇", "🥈", "🥉")
LEADERS_TABLE = (
    "🏆🏆🏆 *Таблиця лідерів TOP\\-3* 🏆🏆🏆\n\n"
    "😌 *Звичайна гра*\n"
    "Рекорд по крокам:\n{0}"
    "Найкращий час:\n{1}\n"
    "🤪 *Складна гра*\n"
    "Рекорд по крокам:\n{2}"
    "Найкращий час:\n{3}"
)

STATS_TITLE = "✍ *Статистика твоїх ігор:*\n\n"
STATS_NORMAL = (
    "*Звичайний режим*:\n"
    " 😌 зіграно {0}\n"
    " 😌 рекорд по крокам {1}\n"
    " 😌 найкращий час {2}\n\n"
)
STATS_HARD = (
    "*Складний режим*:\n"
    " 🤪 зіграно {0}\n"
    " 🤪 рекорд по крокам {1}\n"
    " 🤪 найкращий час {2}"
)
STATS_OTHER_CHAT = (
    "{0}, персональна статистика надіслана у твій "
    "особистий екземпляр @ColdHotGameBot\\!"
)
STATS_NO_GAMES = "На жаль, жодної гри наразі не зіграно 🥺"

STICKER_REPLY = "🗿"
UNDER_CONSTRUCTION = "⚠ Наразі в розробці"


if __name__ == "__main__":
    print(__doc__)
