"""
This module contains all messages for ColdHotGame bot

ColdHotGame bot v1.1 (c) 2020 Maksym Trineyev
mtrineyev@gmail.com
"""


relpies = ('😽', '😮', '❤', '🤯', '💩', '😂', '🥱', '💤', '😉', '🙃',
           'Як ся маєш? 😎', 'Можливо все ж таки зіграємо? 😉',
           'Зараз усну... 😪', 'A big apardon 😐')
errors = ('Таких чисел не буває 🤨', 'Прошу? 🤔',
          'А кількість спроб більшає 🤭', '⏱ Тік-так, тік-так...',
          'Раз, два, три — починаю мерзнутИ ☃')
hints = ('👻', '🌚', 'Арктика!!! 🥶', 'Вічна мерзлота!!. 😱', 'Морозилка!.. 😨',
         'Холодно... 😕', 'Прохолодно 😐', 'Тепло 🙂', 'Спекотно... ☺',
         'Гаряче!.. 🤒', 'Пекельно!!. 🥵', 'Підгарає!!! 😈', 'Зовсім поруч 🔥🔥🔥',
         '@NameTheNumberBot 🚀')
medals = ('🥇', '🥈', '🥉')

command_help = '*Команди:*\n'\
    '/start — 😌 звичайна гра\n'\
    '/hardcore — 🤪 складна гра\n'\
    '/stop — ✋ зупинити запущену гру\n'\
    '/leaders — 🎖 таблиця лідерів TOP-3\n'\
    '/stats — ✍ статистика твоїх ігор\n'\
    '/help — 🤝 допомога\n\n'\
    '*Самореклама:*\n'\
    '@NameTheNumberBot — назви чисел'
hello = '👋 Привіт, *{0}!* Радий познайомитися 🥰 '\
    'Якщо потрібна допомога, команда /help завжди до твоїх послуг'
ingame_help =\
    '📌 *Підказка* натякає, як _далеко_ 📏 твоя здогадка знаходиться '\
    'від задуманого 🤖 числа. Чим гарячіше 🔥, тим ти ближче і навпаки — '\
    'чим холодніше 🥶, тим твоє число далі від відповіді.\n\n'\
    '❗ Оцінюється лише _відстань_ до числа, а не більше воно, чи меньше. '\
    'Наприклад, якщо 🤖 задумав число 200, '\
    'то для 195 та 205 підказка буде та ж сама — 😈\n\n'\
    '*Підказки:*\n'\
    '🥶😱😨😕😐🙂☺🤒🥵😈🔥\n\n'\
    '*Зупинити* поточну гру — /stop'

start_commands = '/start чи /hardcore 😉'
start_game = '*Гра починається!* 🏁 '\
    'Мною загадане ціле число від 1 до {0} 🤐 '\
    'Зрозумій, що означають підказки 🤔, '\
    'та відгадай число якнайшвидше 🚀 '\
    'Для виходу з гри у будь який час можна набрати /stop 🛑'
end_game = '*Бінго!* 🥳🏅 Число угадане за {0} 🏹 '\
    'Час: {1} ⏱ Сподіваюся, тобі сподобалося 🙃 '\
    'Завжди можна зіграти знову, якщо набрати ' + start_commands
break_game = '🛑 *Гра перервана*. Щоб запустити нову, набери ' + start_commands
no_game_started = 'Неможливо зупинити те, що не рухається © МТ 😏'

exclamation = '\n*Wow!* 🎊🎁🎉'
record_header = '\n🏆 Встановлено новий персональний рекорд по '
record_hard_steps = record_header + 'крокам у складній грі'
record_hard_time = record_header + 'по часу у складній грі'
record_steps = record_header + 'крокам у звичайній грі'
record_time = record_header + 'часу у звичайній грі'
record_footer = '\n🎖 Щоб подивитися таблицю лідерів, набери /leaders'\
    '\n💪 Щоб дізнатися статистику своїх ігор, набери /stats'

leaders_title = '🏆🏆🏆 <b>Таблиця лідерів TOP-3</b> 🏆🏆🏆\n\n'\
    '😌 <b>Звичайна гра</b>\n'\
    'Найменьше кроків:\n{0}'\
    'Кращий час:\n{1}\n'\
    '🤪 <b>Складна гра</b>\n'\
    'Найменьше кроків:\n{2}'\
    'Кращий час:\n{3}'

stats_title = '✍ *Статистика твоїх ігор:*\n'
stats_normal = '\n😌 *Звичайний режим*: {0}\n'\
    'найменьше кроків {2}\n'\
    'кращий час {1}\n'
stats_hard = '\n🤪 *Складний режим*: {0}\n'\
    'найменьше кроків {2}\n'\
    'кращий час {1}'
stats_nogames = 'Жодної гри наразі не зіграно 🥺'

sticker_reply = '🗿'
under_construction = '⚠ Наразі в розробці'

hours = ('година', 'години', 'годин')
minutes = ('хвилина', 'хвилини', 'хвилин')
seconds = ('секунда', 'секунди', 'секунд')
tries = ('ход', 'ходи', 'ходів')
games = ('гра', 'гри', 'ігор')


if __name__ == '__main__':
    print(__doc__)